Revit 2024 API
BuiltInFailures.ScaleFailures Class
 Failures about Scale.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class ScaleFailures
Visual Basic
Public NotInheritable Class ScaleFailures
Visual C++
public ref class ScaleFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ScaleFailures
See Also
BuiltInFailures.ScaleFailures Members
Autodesk.Revit.DB Namespace